zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_ipcc.h
/**
  * @brief  Clear IPCC receive channel status for processor 1.
  * @note   Associated with IPCC_C2TOC1SR.CHxF
  * @rmtoll C1SCR        CH1C           LL_C1_IPCC_ClearFlag_CHx\n
  *         ..\n
  *         C1SCR        CH16C          LL_C1_IPCC_ClearFlag_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C1_IPCC_ClearFlag_CHx(IPCC_TypeDef *IPCCx, uint32_t Channel)
{
  SET_BIT(IPCCx->C1SCR, Channel);
}

/**
  * @brief  Set IPCC transmit channel status for processor 1.
  * @note   Associated with IPCC_C1TOC2SR.CHxF
  * @rmtoll C1SCR        CH1S           LL_C1_IPCC_SetFlag_CHx\n
  *         ...\n
  *         C1SCR        CH16S          LL_C1_IPCC_SetFlag_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C1_IPCC_SetFlag_CHx(IPCC_TypeDef *IPCCx, uint32_t Channel)
{
  SET_BIT(IPCCx->C1SCR, Channel << IPCC_C1SCR_CH1S_Pos);
}

/**
  * @brief  Get channel status for processor 1.
  * @rmtoll C1TOC2SR        CH1F           LL_C1_IPCC_IsActiveFlag_CHx\n
  *         ...\n
  *         C1TOC2SR        CH16F          LL_C1_IPCC_IsActiveFlag_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C1_IPCC_IsActiveFlag_CHx(IPCC_TypeDef  const *const IPCCx, uint32_t Channel)
{
  return ((READ_BIT(IPCCx->C1TOC2SR, Channel) == (Channel)) ? 1UL : 0UL);
}

/**
  * @brief  Clear IPCC receive channel status for processor 2.
  * @note   Associated with IPCC_C1TOC2SR.CHxF
  * @rmtoll C2SCR        CH1C           LL_C2_IPCC_ClearFlag_CHx\n
  *         ...\n
  *         C2SCR        CH16C          LL_C2_IPCC_ClearFlag_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C2_IPCC_ClearFlag_CHx(IPCC_TypeDef *IPCCx, uint32_t Channel)
{
  SET_BIT(IPCCx->C2SCR, Channel);
}

/**
  * @brief  Set IPCC transmit channel status for processor 2.
  * @note   Associated with IPCC_C2TOC1SR.CHxF
  * @rmtoll C2SCR        CH1S           LL_C2_IPCC_SetFlag_CHx\n
  *         ...\n
  *         C2SCR        CH16S          LL_C2_IPCC_SetFlag_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C2_IPCC_SetFlag_CHx(IPCC_TypeDef *IPCCx, uint32_t Channel)
{
  SET_BIT(IPCCx->C2SCR, Channel << IPCC_C2SCR_CH1S_Pos);
}

/**
  * @brief  Get channel status for processor 2.
  * @rmtoll C2TOC1SR        CH1F           LL_C2_IPCC_IsActiveFlag_CHx\n
  *         ...\n
  *         C2TOC1SR        CH16F          LL_C2_IPCC_IsActiveFlag_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be one of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_C2_IPCC_IsActiveFlag_CHx(IPCC_TypeDef  const *const IPCCx, uint32_t Channel)
{
  return ((READ_BIT(IPCCx->C2TOC1SR, Channel) == (Channel)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Privilege Configuration.
  * @rmtoll C1PRIVCFGR        CH1PRIV           LL_C1_IPCC_Enable_PRIVCFGR_CHx\n
  *         ...\n
  *         C1PRIVCFGR        CH16PRIV          LL_C1_IPCC_Enable_PRIVCFGR_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C1_IPCC_Enable_PRIVCFGR_CHx(IPCC_TypeDef *const IPCCx, uint32_t Channel)
{
  SET_BIT(IPCCx->C1PRIVCFGR, Channel);
}

/**
  * @brief  Disable Privilege Configuration.
  * @rmtoll C1PRIVCFGR        CH1PRIV           LL_C1_IPCC_Disable_PRIVCFGR_CHx\n
  *         ...\n
  *         C1PRIVCFGR        CH16PRIV          LL_C1_IPCC_Disable_PRIVCFGR_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C1_IPCC_Disable_PRIVCFGR_CHx(IPCC_TypeDef *const IPCCx, uint32_t Channel)
{
  CLEAR_BIT(IPCCx->C1PRIVCFGR, Channel);
}

/**
  * @brief  Get channel Priv status for processor 1.
  * @rmtoll C1PRIVCFGR        CH1PRIV           LL_C1_IPCC_IsEnabledPriv_CHx\n
  *         ...\n
  *         C1PRIVCFGR        CH16PRIV          LL_C1_IPCC_IsEnabledPriv_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE uint32_t LL_C1_IPCC_IsEnabledPriv_CHx(IPCC_TypeDef const *const IPCCx, uint32_t Channel)
{
  return ((READ_BIT(IPCCx->C1PRIVCFGR, Channel) == (Channel)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Privilege Configuration.
  * @rmtoll C2PRIVCFGR        CH1PRIV           LL_C2_IPCC_Enable_PRIVCFGR_CHx\n
  *         ...\n
  *         C2PRIVCFGR        CH16PRIV          LL_C2_IPCC_Enable_PRIVCFGR_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C2_IPCC_Enable_PRIVCFGR_CHx(IPCC_TypeDef *const IPCCx, uint32_t Channel)
{
  SET_BIT(IPCCx->C2PRIVCFGR, Channel);
}

/**
  * @brief  Disable Privilege Configuration.
  * @rmtoll C2PRIVCFGR        CH1PRIV           LL_C2_IPCC_Disable_PRIVCFGR_CHx\n
  *         ...\n
  *         C2PRIVCFGR        CH16PRIV          LL_C2_IPCC_Disable_PRIVCFGR_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C2_IPCC_Disable_PRIVCFGR_CHx(IPCC_TypeDef *const IPCCx, uint32_t Channel)
{
  CLEAR_BIT(IPCCx->C2PRIVCFGR, Channel);
}

/**
  * @brief  Get channel Privilege status for processor 2.
  * @rmtoll C2PRIVCFGR        CH1PRIV           LL_C2_IPCC_IsEnabledPriv_CHx\n
  *         ...\n
  *         C2PRIVCFGR        CH16PRIV          LL_C2_IPCC_IsEnabledPriv_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE uint32_t LL_C2_IPCC_IsEnabledPriv_CHx(IPCC_TypeDef const *const IPCCx, uint32_t Channel)
{
  return ((READ_BIT(IPCCx->C2PRIVCFGR, Channel) == (Channel)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Secure Configuration.
  * @rmtoll C1SECCFGR        CH1SEC           LL_C1_IPCC_Enable_SECCFGR_CHx\n
  *         ...\n
  *         C1SECCFGR        CH16SEC          LL_C1_IPCC_Enable_SECCFGR_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C1_IPCC_Enable_SECCFGR_CHx(IPCC_TypeDef *const IPCCx, uint32_t Channel)
{
  SET_BIT(IPCCx->C1SECCFGR, Channel);
}

/**
  * @brief  Disable Secure Configuration.
  * @rmtoll C1SECCFGR        CH1SEC           LL_C1_IPCC_Disable_SECCFGR_CHx\n
  *         ...\n
  *         C1SECCFGR        CH16SEC          LL_C1_IPCC_Disable_SECCFGR_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C1_IPCC_Disable_SECCFGR_CHx(IPCC_TypeDef *const IPCCx, uint32_t Channel)
{
  CLEAR_BIT(IPCCx->C1SECCFGR, Channel);
}

/**
  * @brief  Get channel Secure status for processor 1.
  * @rmtoll C1SECCFGR        CH1SEC           LL_C1_IPCC_IsEnabledSec_CHx\n
  *         ...\n
  *         C1SECCFGR        CH16SEC          LL_C1_IPCC_IsEnabledSec_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE uint32_t LL_C1_IPCC_IsEnabledSec_CHx(IPCC_TypeDef const *const IPCCx, uint32_t Channel)
{
  return ((READ_BIT(IPCCx->C1SECCFGR, Channel) == (Channel)) ? 1UL : 0UL);
}

/**
  * @brief  Enable Secure configuration for processor 2.
  * @rmtoll C2SECCFGR        CH1SEC           LL_C2_IPCC_Enable_SECCFGR_CHx\n
  *         ...\n
  *         C2SECCFGR        CH16SEC          LL_C2_IPCC_Enable_SECCFGR_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C2_IPCC_Enable_SECCFGR_CHx(IPCC_TypeDef *const IPCCx, uint32_t Channel)
{
  SET_BIT(IPCCx->C2SECCFGR, Channel);
}

/**
  * @brief  Disable Secure configuration for processor 2.
  * @rmtoll C2SECCFGR        CH1SEC           LL_C2_IPCC_Disable_SECCFGR_CHx\n
  *         ...\n
  *         C2SECCFGR        CH16SEC          LL_C2_IPCC_Disable_SECCFGR_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE void LL_C2_IPCC_Disable_SECCFGR_CHx(IPCC_TypeDef *const IPCCx, uint32_t Channel)
{
  CLEAR_BIT(IPCCx->C2SECCFGR, Channel);
}

/**
  * @brief  Get channel Secure status for processor 2.
  * @rmtoll C2SECCFGR        CH1SEC           LL_C1_IPCC_IsEnabledPriv_CHx\n
  *         ...\n
  *         C2SECCFGR        CH16SEC          LL_C1_IPCC_IsEnabledPriv_CHx
  * @param  IPCCx IPCC Instance.
  * @param  Channel This parameter can be a combination of the following values:
  *         @arg @ref LL_IPCC_CHANNEL_1
  *         ...
  *         @arg @ref LL_IPCC_CHANNEL_16
  * @retval None
  */
__STATIC_INLINE uint32_t LL_C2_IPCC_IsEnabledSec_CHx(IPCC_TypeDef const *const IPCCx, uint32_t Channel)
{
  return ((READ_BIT(IPCCx->C2SECCFGR, Channel) == (Channel)) ? 1UL : 0UL);
}

/**
  * @brief  Disable Processor 1 CID filtering.
  * @rmtoll C1CIDCFGR         IPCC          LL_IPCC_Disable_C1_CID_Filtering
  * @param  IPCCx IPCC Instance.
  * @retval None
  */
__STATIC_INLINE void LL_IPCC_Disable_C1_CID_Filtering(IPCC_TypeDef *const IPCCx)
{
  CLEAR_BIT(IPCCx->C1CIDCFGR, IPCC_C1CIDCFGR_CFEN);
}

/**
  * @brief  Configure CID filtering for Processor 1.
  * @rmtoll C1CIDCFGR         IPCC          LL_IPCC_Config_C1_CID_Filtering
  * @param  IPCCx IPCC Instance.
  * @param  CIDDomainId Value between Min_Data=0 and Max_Data=7
  * @retval None
  */
__STATIC_INLINE void LL_IPCC_Config_C1_CID_Filtering(IPCC_TypeDef *const IPCCx, uint32_t CIDDomainId)
{
  WRITE_REG(IPCCx->C1CIDCFGR, ((CIDDomainId << IPCC_C1CIDCFGR_CID_Pos) | IPCC_C1CIDCFGR_CFEN));
}

/**
  * @brief  Disable Processor 2 CID filtering.
  * @rmtoll C2CIDCFGR         IPCC          LL_IPCC_Disable_C2_CID_Filtering
  * @param  IPCCx IPCC Instance.
  * @retval None
  */
__STATIC_INLINE void LL_IPCC_Disable_C2_CID_Filtering(IPCC_TypeDef *const IPCCx)
{
  CLEAR_BIT(IPCCx->C2CIDCFGR, IPCC_C2CIDCFGR_CFEN);
}

/**
  * @brief  Configure CID filtering for Processor 2.
  * @rmtoll C2CIDCFGR         IPCC          LL_IPCC_Config_C2_CID_Filtering
  * @param  IPCCx IPCC Instance.
  * @param  CIDDomainId Value between Min_Data=0 and Max_Data=7
  * @retval None
  */
__STATIC_INLINE void LL_IPCC_Config_C2_CID_Filtering(IPCC_TypeDef *const IPCCx, uint32_t CIDDomainId)
{
  WRITE_REG(IPCCx->C2CIDCFGR, ((CIDDomainId << IPCC_C2CIDCFGR_CID_Pos) | IPCC_C2CIDCFGR_CFEN));
}

/**
  * @brief  Get the number of supported channels.
  * @rmtoll HWCFGR        CHANNELS         LL_IPCC_GetChannelNumber
  * @param  IPCCx IPCC Instance.
  * @retval Number of supported channels.
  */
__STATIC_INLINE uint32_t LL_IPCC_GetChannelNumber(IPCC_TypeDef *IPCCx)
{
  return READ_BIT(IPCCx->HWCFGR, IPCC_HWCFGR_CHANNELS) >> IPCC_HWCFGR_CHANNELS_Pos;
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* IPCC || IPCC1 || IPCC2 */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32MP2xx_LL_IPCC_H */
